

Функция ПустоеЗначениеТипа(ЗаданныйТип)
	
	Если ЗаданныйТип = Тип("Число") Тогда
		Возврат 0;
	ИначеЕсли ЗаданныйТип = Тип("Строка") Тогда
		Возврат "";
	ИначеЕсли ЗаданныйТип = Тип("Дата") Тогда
		Возврат '00010101000000';
	ИначеЕсли ЗаданныйТип = Тип("Булево") Тогда
		Возврат Ложь;
	Иначе
		Возврат Новый (ЗаданныйТип);
	КонецЕсли;
	
КонецФункции // ПустоеЗначениеТипа();

Функция ВидСравненияСтр(ТипВидСравнения)
//	
Если ТипВидСравнения =  ВидСравнения.Равно Тогда
			ВидСравненияСтрокой  =  " = " 
ИначеЕсли ТипВидСравнения  =  ВидСравнения.НеРавно Тогда
			ВидСравненияСтрокой  =  "<>"
ИначеЕсли ТипВидСравнения  =  ВидСравнения.ВСписке Тогда
			ВидСравненияСтрокой  =  "В"
ИначеЕсли ТипВидСравнения  =  ВидСравнения.НеВСписке Тогда
			ВидСравненияСтрокой  =  "НЕ В"
ИначеЕсли ТипВидСравнения  =  ВидСравнения.ВСпискеПоИерархии ИЛИ 
			ТипВидСравнения   =  ВидСравнения.ВИерархии Тогда
			ВидСравненияСтрокой  =  "В ИЕРАРХИИ"
ИначеЕсли ТипВидСравнения  =  ВидСравнения.НеВСпискеПоИерархии ИЛИ 
			ТипВидСравнения   =  ВидСравнения.НеВИерархии Тогда
			ВидСравненияСтрокой  =  "НЕ В ИЕРАРХИИ"
КонецЕсли; 
//
Возврат ВидСравненияСтрокой;
//
КонецФункции	

Функция ПолучитьПоследниеПоступления(СпТов)

зп = новый запрос;  
зп.УстановитьПараметр("Номенклатура", СпТов);

зп.Текст = "ВЫБРАТЬ
|	ПоследниеДокументы.Номенклатура КАК Номенклатура,
|	МАКСИМУМ(ПоследниеДокументы.Цена) КАК ЦенаЗакупки,
|	ПоследниеДокументы.Ссылка КАК ДокЗакупки
|ИЗ
|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоследниеДокументы
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
|			Доки.Номенклатура КАК Номенклатура,
|			МАКСИМУМ(Доки.Ссылка.Дата) КАК ДатаПоследнегоДокумента
|		ИЗ
|			Документ.ПоступлениеТоваровУслуг.Товары КАК Доки
|		ГДЕ
|			Доки.Номенклатура В(&Номенклатура)
|			И Доки.Ссылка.Проведен
|		
|		СГРУППИРОВАТЬ ПО
|			Доки.Номенклатура) КАК ДатыПоследнихДокументов
|		ПО ПоследниеДокументы.Номенклатура = ДатыПоследнихДокументов.Номенклатура
|			И ПоследниеДокументы.Ссылка.Дата = ДатыПоследнихДокументов.ДатаПоследнегоДокумента
|ГДЕ
|	ПоследниеДокументы.Номенклатура В(&Номенклатура)
|	И ПоследниеДокументы.Ссылка.Проведен
|
|СГРУППИРОВАТЬ ПО
|	ПоследниеДокументы.Номенклатура,
|	ПоследниеДокументы.Ссылка";

рез = зп.Выполнить();
тз = рез.Выгрузить();

Возврат тз;
	
КонецФункции	

Процедура СформироватьОтчет(тб) Экспорт
	
Макет = ПолучитьМакет("Макет");
обл = макет.ПолучитьОбласть("шапка");

зп = новый запрос;

Условие = "";
ПечОтбор = "";

Если ФлажокНастройкиСклад тогда
    зп.УстановитьПараметр("Склад", Склад);
    СтрокаСравнения = ВидСравненияСтр(ВидСравненияСклад);
    Условие = Условие+" И ПоследниеДокументы.Ссылка.Склад "+СтрокаСравнения+" (&Склад) ";
    ПечОтбор = ПечОтбор + "Склад: " + ВидСравненияСклад + " " + сокрлп(Склад) + "; "
КонецЕсли;	

Если ФлажокНастройкиНоменклатура тогда
  зп.УстановитьПараметр("Номенклатура", Номенклатура);
  СтрокаСравнения = ВидСравненияСтр(ВидСравненияНоменклатура);
  Условие = Условие+" И Доки.Номенклатура "+СтрокаСравнения+" (&Номенклатура) ";
  ПечОтбор = ПечОтбор + "Номенклатура: " + ВидСравненияНоменклатура + " " + сокрлп(Номенклатура) + "; "
КонецЕсли;	

Если ФлажокНастройкиКонтрагент тогда
    зп.УстановитьПараметр("Контрагент", Контрагент);
    СтрокаСравнения = ВидСравненияСтр(ВидСравненияКонтрагент);
    Условие = Условие+" И Доки.Ссылка.Контрагент "+СтрокаСравнения+" (&Контрагент) ";
    ПечОтбор = ПечОтбор + "Контрагент: " + ВидСравненияКонтрагент + " " + сокрлп(Контрагент) + "; "
КонецЕсли;	

обл.Параметры.ДатаНач = СокрЛП(Формат(ДатаНач, "ДФ=dd.MM.yy"));
обл.Параметры.ДатаКон = СокрЛП(Формат(ДатаКон, "ДФ=dd.MM.yy"));
обл.Параметры.ПечОтбор = ПечОтбор; 

тб.Вывести(обл);

// =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  = 
зп.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
зп.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));

//"+Условие+"
зп.Текст = "ВЫБРАТЬ
           |	ПоследниеДокументы.Номенклатура КАК Номенклатура,
           |	МАКСИМУМ(ПоследниеДокументы.Цена) КАК ЦенаПродажи,
           |	ПоследниеДокументы.Ссылка КАК ДокПродажи,
           |	ПоследниеДокументы.Номенклатура.Артикул КАК Артикул,
           |	ПоследниеДокументы.Номенклатура.Производитель КАК Производитель,
           |	ПоследниеДокументы.Номенклатура.БазоваяЕдиницаИзмерения КАК Ед,
           |	1 КАК Количество
           |ИЗ
           |	Документ.РеализацияТоваровУслуг.Товары КАК ПоследниеДокументы
           |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
           |			Доки.Номенклатура КАК Номенклатура,
           |			МАКСИМУМ(Доки.Ссылка.Дата) КАК ДатаПоследнегоДокумента
           |		ИЗ
           |			Документ.РеализацияТоваровУслуг.Товары КАК Доки
           |		ГДЕ
           |			Доки.Ссылка.Проведен = ИСТИНА
           |			И Доки.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон "+Условие+"
           |		
           |		СГРУППИРОВАТЬ ПО
           |			Доки.Номенклатура) КАК ДатыПоследнихДокументов
           |		ПО ПоследниеДокументы.Номенклатура = ДатыПоследнихДокументов.Номенклатура
           |			И ПоследниеДокументы.Ссылка.Дата = ДатыПоследнихДокументов.ДатаПоследнегоДокумента
           |ГДЕ
           |	ПоследниеДокументы.Ссылка.Проведен = ИСТИНА
           |	И ПоследниеДокументы.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон 
           |
           |СГРУППИРОВАТЬ ПО
           |	ПоследниеДокументы.Номенклатура,
           |	ПоследниеДокументы.Ссылка,
           |	ПоследниеДокументы.Номенклатура.Артикул,
           |	ПоследниеДокументы.Номенклатура.Производитель,
           |	ПоследниеДокументы.Номенклатура.БазоваяЕдиницаИзмерения
           |
           |УПОРЯДОЧИТЬ ПО
           |	Номенклатура
           |АВТОУПОРЯДОЧИВАНИЕ";

рез = зп.Выполнить();

тз = рез.Выгрузить();    
СпТов = тз.ВыгрузитьКолонку("Номенклатура");

тз_прих = ПолучитьПоследниеПоступления(СпТов);

выб = рез.Выбрать();
Пока выб.Следующий() цикл

обл = макет.ПолучитьОбласть("строка");
обл.Параметры.Заполнить(выб);

стр_прих = тз_прих.Найти(выб.Номенклатура); 
Если стр_прих <> Неопределено тогда
  обл.Параметры.Заполнить(стр_прих);
КонецЕсли;	                      

обл.Параметры.ПечНоменклатура = СокрЛП(выб.Номенклатура.НаименованиеПолное); 

тб.Вывести(обл);

КонецЦикла; //Пока выб.Следующий() цикл
	
	
// =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  = 
тб.ОтображатьСетку = Ложь;
тб.ТолькоПросмотр = Истина;
//тб.ОтображатьГруппировки = Истина;
тб.ОтображатьЗаголовки = Ложь;
//тб.ФиксацияСлева = 1;
тб.ФиксацияСверху = 5;
	
КонецПроцедуры //СформироватьОтчет(тб)
 	